Fese673/ZEGAR-ESP32/src/main.cpp
// --- Flaga do przywrócenia czasu z RTC (po soft reset) ---
static bool timeRestored = false;

// DS3231 persistence: write system time to RTC after successful NTP sync
static bool rtcWritePending = false;
static unsigned long lastRtcWriteAttemptMillis = 0;
static unsigned long rtcWriteNotBeforeMillis = 0;
static uint8_t rtcWriteFailureCount = 0;
static time_t rtcPendingEpoch = 0;
static unsigned long lastSeenNtpSyncMillis = 0;

static const char* TZ_POLAND = "CET-1CEST,M3.5.0,M10.5.0/3";

static bool isSystemTimeValid() {
  // 2021-01-01 00:00:00 UTC
  return time(nullptr) >= 1609459200;
}

static unsigned long rtcComputeBackoffMs(uint8_t failures) {
  // 0->0ms, 1->1s, 2->2s, 3->5s, 4->10s, 5->20s, >=6->60s
  if (failures == 0) return 0;
  if (failures == 1) return 1000;
  if (failures == 2) return 2000;
  if (failures == 3) return 5000;
  if (failures == 4) return 10000;
  if (failures == 5) return 20000;
  return 60000;
}

static void scheduleRtcWriteFromSystemTime() {
  if (!isSystemTimeValid()) return;
  rtcPendingEpoch = time(nullptr);
  rtcWritePending = true;
  rtcWriteFailureCount = 0;

  // Give the loop a moment after SNTP update (and reduce chance of I2C collisions)
  rtcWriteNotBeforeMillis = millis() + 2000UL;
}

static void syncLocalClockFromSystemTime() {
  time_t now = time(nullptr);
  struct tm ti;
  localtime_r(&now, &ti);
  hours = ti.tm_hour;
  minutes = ti.tm_min;
  seconds = ti.tm_sec;
}

static void tryRestoreSystemTimeFromDs3231() {
  RTCService::Config rtcCfg;
  rtcCfg.wire = &Wire;
  rtcCfg.sdaPin = 21;
  rtcCfg.sclPin = 22;
  rtcCfg.i2cClockHz = 400000;
  rtcCfg.i2cTimeoutMs = 10;
  rtcCfg.i2cRetries = 2;
  rtcCfg.initI2cMaster = false; // Wire.begin() already done in setup()
  rtcCfg.enableI2cDiagnostics = true;

  const RTCService::Status st = RTCService::begin(rtcCfg);
  Serial.printf("[RTC] begin: %s\n", RTCService::statusToString(st));
  if (st != RTCService::Status::Ok) {
    return;
  }

  time_t epoch = 0;
  const RTCService::Status rd = RTCService::getEpoch(&epoch);
  Serial.printf("[RTC] getEpoch: %s epoch=%ld\n", RTCService::statusToString(rd), (long)epoch);
  if (rd != RTCService::Status::Ok) {
    return;
  }

  // Additional sanity: ignore clearly invalid timestamps.
  if (epoch < 1609459200) {
    Serial.println("[RTC] epoch too old/invalid; ignoring");
    return;
  }

  timeval tv;
  tv.tv_sec = epoch;
  tv.tv_usec = 0;
  settimeofday(&tv, nullptr);

  lastTick = millis();
  syncLocalClockFromSystemTime();
  Serial.printf("[RTC] system time restored from DS3231 (local %02d:%02d:%02d)\n", hours, minutes, seconds);
}

static void handleRtcWriteIfPending() {
  if (!rtcWritePending) return;
  if (!RTCService::isReady()) return;
  if (!isSystemTimeValid()) return;

  const unsigned long nowMs = millis();

  if (nowMs < rtcWriteNotBeforeMillis) return;
  // Avoid hammering the device on repeated failures.
  if (lastRtcWriteAttemptMillis != 0 && (nowMs - lastRtcWriteAttemptMillis) < 1000UL) return;

  const time_t epochToWrite = (rtcPendingEpoch != 0) ? rtcPendingEpoch : time(nullptr);
  const RTCService::Status st = RTCService::setEpoch(epochToWrite, true);
  Serial.printf("[RTC] setEpoch: %s epoch=%ld\n", RTCService::statusToString(st), (long)epochToWrite);
  lastRtcWriteAttemptMillis = nowMs;

  if (st == RTCService::Status::Ok) {
    rtcWritePending = false;
    rtcPendingEpoch = 0;
    rtcWriteFailureCount = 0;
    rtcWriteNotBeforeMillis = 0;
    return;
  }

  rtcWriteFailureCount++;
  rtcWriteNotBeforeMillis = nowMs + rtcComputeBackoffMs(rtcWriteFailureCount);
}

// --- MQTT Mode Control ---
static bool mqtt_initialized = false;
static RadioModeSwitchState last_radio_mode = RADIO_STATE_WIFI;
bool mqttEnabled = true;

// --- DHT Sensor ---
DHT dht(DHT_PIN, DHT_TYPE);
bool dhtScreenDirty = true;
int  savedHours     = 0;
int  savedMinutes   = 0;
int  savedSeconds   = 0;
bool timeSaved      = false;

// Flaga do wymuszenia rysowania ekranów PMS5003 przy wejściu do podmenu
bool pmsScreenDirty = true;

// Odczyty DHT
float dhtTemperature = 0.0f; // compensated (used by app)
float dhtTemperatureRaw = 0.0f; // raw sensor reading for diagnostics
float dhtHumidity    = 0.0f;

// Stabilizacja odczytów
bool dhtReady = false;
unsigned long dhtLastRead = 0;
constexpr unsigned long DHT_READ_INTERVAL_MS = 2000;


// ============================================================================
// IMPLEMENTACJA FUNKCJI - LOGIKA ZEGARA
// ============================================================================

void tickClock() {
  if (appState == STATE_SET_TIME) return;

  // Prefer system time when it's valid (keeps HH:MM:SS consistent with date and NTP corrections)
  const unsigned long nowMs = millis();
  if (isSystemTimeValid()) {
    if (nowMs - lastTick >= CLOCK_TICK_MS) {
      // Align to 1s tick cadence
      lastTick = nowMs - ((nowMs - lastTick) % CLOCK_TICK_MS);
      syncLocalClockFromSystemTime();

      if (appState != STATE_STOPER) {
        updateSevenSeg();
      }
      if (appState == STATE_HOME) {
        requestHomeRedraw();
      }
    }

    // Alarm logic uses hours/minutes/seconds updated above
    const bool alarmShouldTrigger = alarmEnabled && !alarmRinging &&
                                     hours == alarmHour &&
                                     minutes == alarmMinute &&
                                     seconds == 0;
    if (alarmShouldTrigger) {
      alarmRinging   = true;
      alarmStartTime = millis();
      lastMelodyStep = 0;
    }
    // Timer handling (when running) - check expiration
    if (timerRunning) {
      unsigned long elapsed = nowMs - timerStartMillis;
      if (elapsed >= timerDurationMs) {
        timerRunning = false;
        // reuse alarm ringing machinery to play melody
        alarmRinging = true;
        alarmStartTime = millis();
        lastMelodyStep = 0;
        // After finishing, return to editable timer form (hours editing)
        editState = EDIT_HOURS;
        timerStartMillis = 0;
        timerDurationMs = 0;
      }
    }
    return;
  }

  // Catch up missed ticks if loop was blocked for multiple seconds
  unsigned long now = nowMs;
  if (nowMs - lastTick >= CLOCK_TICK_MS) {
    // Limit catch-up iterations to avoid long loops in extreme cases
    int loops = 0;
    while (now - lastTick >= CLOCK_TICK_MS && loops < 60) {
      lastTick += CLOCK_TICK_MS;
      seconds++;

