Fese673/ZEGAR-ESP32/src/main.cpp
  // Load persisted rotation interval (seconds) from NVS/Preferences if present
  s_prefs.begin("zegar", false);
  settingsRotationSec = s_prefs.getUShort("homeOverlaySec", (uint16_t)settingsRotationSec);
  if (settingsRotationSec < 1) settingsRotationSec = 1;
  if (settingsRotationSec > 10) settingsRotationSec = 10;
  s_homeOverlaySwitchMs = (unsigned long)settingsRotationSec * 1000UL;
  s_prevSettingsRotationSec = settingsRotationSec;
  mqttEnabled = s_prefs.getBool("mqttEnabled", true);
  settingsMqttMenuIndex = mqttEnabled ? 0 : 1;

  // ===== WiFi / NTP Sync =====
  WiFiSync::setTimeRefs(hours, minutes, seconds, lastTick);        // referencje do zmiennych czasu
  WiFiSync::setOnDone([]() {
    const unsigned long ntpSyncMs = WiFiSync::getLastNtpSyncTime();
    if (ntpSyncMs != 0 && ntpSyncMs != lastSeenNtpSyncMillis) {
      lastSeenNtpSyncMillis = ntpSyncMs;
      scheduleRtcWriteFromSystemTime();
    }
    drawHomeThrottled();
  });
  WiFiSync::begin(WIFI_SSID, WIFI_PASS, NTP_SERVER);

  // ===== MQTT Sync (Core 1) - initialized only in WiFi mode =====
  // MQTTSync will be initialized later in RadioModeSwitch::update() when WiFi mode is confirmed
  Serial.println("[main] MQTT will start when WiFi mode is active");

  // ===== RadioModeSwitch inicjalizuje się, ale faktyczna inicjalizacja WiFi/BT =====
  // będzie opóźniona w loop() aby zagwarantować że LCD jest w pełni gotowe
  
  // Synchronizuj radioMode ze stanem RadioModeSwitch na starcie
  if (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

  ModeManager::logDiag("after-setup-radio-ready");
}

// ============================================================================
// LOOP
// ============================================================================

void loop() {
  handleHomeEntryIfStateChanged();

  // --- Encoder handling ---
  const EncoderEvent evt = encoder_update();
  if (evt != ENC_NONE) {
    // === REGISTER STATS ===
    if (evt == ENC_CLICK || evt == ENC_LONG) {
      statsManager.registerClick();
    } else if (evt == ENC_LEFT) {
      statsManager.registerStepLeft();
    } else if (evt == ENC_RIGHT) {
      statsManager.registerStepRight();
    }

    // Pass event to UI (unless RadioModeSwitch is initializing)
    if (!RadioModeSwitch::isInitializing()) {
      ui_handleEvent(evt);
    }
  }

  // --- Stats update (save to NVS if needed) ---
  statsManager.update();

  // Rotacja zawartości HOME (co 3s) — non-blocking.
  serviceHomeOverlayRotation();

  // HOME LCD refresh (1Hz max, LCD + UART mirror)
  // tickClock() / callbacks mark HOME dirty; this performs the actual draw.
  serviceHomeRedraw();

  // --- System resources update ---
  updateSystemResources();

  // --- PMS5003 update ---
  PMS5003Sensor::update();

  // --- ENS160 + AHT21 update ---
  ENS160AHT21Sensor::update();

  // --- Stats screen refresh (live data update) ---
  static unsigned long lastStatsRedraw = 0;
  if ((appState == STATE_STATS_RESOURCES_CPU || appState == STATE_STATS_RESOURCES_RAM ||
       appState == STATE_STATS_RESOURCES_FLASH || appState == STATE_STATS_RESOURCES ||
       // PMS menus and all detail sub-states
       appState == STATE_PMS5003_CF1 || appState == STATE_PMS5003_CF1_PM1 || appState == STATE_PMS5003_CF1_PM25 || appState == STATE_PMS5003_CF1_PM10 ||
       appState == STATE_PMS5003_ATM || appState == STATE_PMS5003_ATM_PM1 || appState == STATE_PMS5003_ATM_PM25 || appState == STATE_PMS5003_ATM_PM10 ||
       appState == STATE_PMS5003_PARTICLES || appState == STATE_PMS5003_PARTICLES_0_3 || appState == STATE_PMS5003_PARTICLES_0_5 || appState == STATE_PMS5003_PARTICLES_1_0 || appState == STATE_PMS5003_PARTICLES_2_5 || appState == STATE_PMS5003_PARTICLES_5_0 || appState == STATE_PMS5003_PARTICLES_10_0 ||
      appState == STATE_PMS5003_TELEMETRY ||
      appState == STATE_ENS160_AHT21 || appState == STATE_ENS160_AHT21_SUMMARY || appState == STATE_ENS160_AHT21_GAS ||
      appState == STATE_ENS160_AHT21_GAS_AQI || appState == STATE_ENS160_AHT21_GAS_TVOC || appState == STATE_ENS160_AHT21_GAS_ECO2 ||
      appState == STATE_ENS160_AHT21_CLIMATE || appState == STATE_ENS160_AHT21_CLIMATE_TEMP || appState == STATE_ENS160_AHT21_CLIMATE_HUM ||
      appState == STATE_ENS160_AHT21_STATUS) &&
      millis() - lastStatsRedraw >= 1000) {
    lastStatsRedraw = millis();
    drawStats();
  }

  // --- Timer screen refresh (1s) ---
  static unsigned long lastTimerRedraw = 0;
  if (appState == STATE_TIMER && millis() - lastTimerRedraw >= 1000) {
    lastTimerRedraw = millis();
    if (timerRunning || editState == EDIT_DONE) {
      drawTimer();
    }
  }

  // --- Status diagnostics every 2s (disabled in BT mode to not affect audio) ---
  static unsigned long last_status_diag = 0;
  if (!ModeManager::isBtOn() && (millis() - last_status_diag >= 2000)) {
    last_status_diag = millis();
    static uint32_t last_heap = 0;
    uint32_t current_heap = ESP.getFreeHeap();
    int heap_delta = (int)current_heap - (int)last_heap;
    last_heap = current_heap;
    
    Serial.printf("[STATUS] WiFi:%s MQTT:%s BT:%s Heap:%u (%+d) Mode:%s\n",
      ModeManager::isWifiOn() ? "ON" : "OFF",
      mqtt_initialized ? "ON" : "OFF",
      ModeManager::isBtOn() ? "ON" : "OFF",
      current_heap,
      heap_delta,
      (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) ? "BT" : "WiFi");
  }

  // --- Clock tick ---
  tickClock();

  // --- WiFi sync update ---
  WiFiSync::update();

  // --- Persist current system time to DS3231 when requested ---
  handleRtcWriteIfPending();

  // --- RadioModeSwitch update (delayed WiFi/BT init after startup) ---
  RadioModeSwitch::update();

  // --- MQTT Control (start/stop based on WiFi mode + user setting) ---
  RadioModeSwitchState current_radio_mode = RadioModeSwitch::getCurrentState();

  // Hard switch OFF: stop task and never publish.
  if (!mqttEnabled) {
    if (mqtt_initialized) {
      Serial.println("[main] MQTT disabled in settings -> stopping MQTT task");
      MQTTSync::stopCore1Task();
      mqtt_initialized = false;
    }
  }
  else if (current_radio_mode == RADIO_STATE_WIFI && !mqtt_initialized) {
    // Start MQTT only when WiFi is ACTUALLY connected (not just in WiFi mode)
    // Use periodic timer (every 2s) to avoid lock contention with WiFi.status() calls
    static unsigned long lastWiFiCheck = 0;
    if (millis() - lastWiFiCheck >= 2000) {
      lastWiFiCheck = millis();
      if (WiFi.status() == WL_CONNECTED) {
        Serial.println("[main] WiFi connected! Activating MQTT");
        MQTTSync::begin(WIFI_SSID, WIFI_PASS);
        MQTTSync::startCore1Task();
        mqtt_initialized = true;
        last_radio_mode = RADIO_STATE_WIFI;
      }
    }
  } 
  else if (current_radio_mode == RADIO_STATE_BT && mqtt_initialized) {
    // Stop MQTT when switching to BT mode
    Serial.println("[main] Deactivating MQTT for BT mode");
    MQTTSync::stopCore1Task();
    mqtt_initialized = false;
    last_radio_mode = RADIO_STATE_BT;
  }

  // --- MQTT Update (publish sensor data only if enabled+initialized) ---
  if (mqttEnabled && mqtt_initialized) {
    static unsigned long lastMQTTPublish = 0;
    if (millis() - lastMQTTPublish >= 5000) {
      lastMQTTPublish = millis();
      MQTTSync::publishSensorData(dhtTemperature, (int)dhtHumidity, 1013);
    }
  }

  // --- Synchronizuj radioMode ze stanem RadioModeSwitch ---
  // Ważne: to zapewnia, że menu zawsze pokazuje prawidłowy stan
  if (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

